[
    {
        "id": 1,
        "titulo": "Organo",
        "texto": "> Projeto realizado no curso de React: desenvolvendo com Javascript \n\n  ### Descrição do site \n\n O site serve para organizar melhor os times, pode-se atribuir as funções respectivas a cada usuário cadastrado. Este foi o meu primeiro projeto utilizando o framework React, com ele eu me aprimorei em: \n\n - **Implementar componentes reativos** \n\n - **Investigar e analisar mensagens de erro** \n\n - **Modificar e evoluir componentes de acordo com a necessidade do projeto** \n\n - **Prototipar uma aplicação do zero até o deploy** \n\n [Teste o Organo aqui!](https://organo-ju6e35ngu-vichelly.vercel.app/)  \n\n "
    },
    {
        "id": 2,
        "titulo": "Alura Studies",
        "texto": "> Projeto realizado no curso de React: escrevendo com Typescript  \n\n  ### Descrição do site \n\n O alura studies é um gerenciador de tempo, nele é possível incluir matérias e delimitar o tempo pretendido para estudar determinada matéria. Assim que o timer chega a 00:00 o estudo da matéria é concluído. Graças a ele me aprimorei em: \n\n - **Criação de um projeto React com Typescript do zero com React App** \n\n - **Entender conceitos React como Componentização, Props e State.** \n\n - **Evitar sobreposições de CSS com CSS Modules.** \n\n - **Aprender sobre os hooks useState e useEffect e entender como eles eram usados nos class components.** \n\n \n\n - **Deixar o código mais limpo e documentado com a forma mais atual de se escrever React.** \n\n\n\n - **Desenvolver o código com conceitos de boas práticas como DRY (Don't repeat yourself) e SRP (Single Responsibility Principle).** \n\n [Teste o Alura Studies aqui!](https://alura-studies-995zuua9l-vichelly.vercel.app/)  \n\n"
    },
    {
        "id": 3,
        "titulo": "Styled Components",
        "texto": "> Projeto realizado no curso React: abstraindo seu CSS com Styled Components. \n\n  ### Descrição do site \n\n Neste curso eu implementei o Styled Components em um projeto já pronto. O principal desafio foi adicionar o modo escuro no site. Aprimorei minhas habilidades em: \n\n - **Saber como usar o Styled Components dentro do projeto.** \n\n - **Conhecer quando usar os estilos globais.** \n\n - **Evitar sobreposições de CSS com CSS Modules.** \n\n - **Aprenda a utilizar herança dentro dos componentes.** \n\n \n\n - **Compreender as vantagens de um projeto bem organizado.** \n\n [Teste o site aqui!](https://styled-components-khaki.vercel.app/)  \n\n "
    },
    {
        "id": 4,
        "titulo": "Galeria Espacial",
        "texto": "> Projeto realizado no curso React com JavaScript: lidando com arquivos estáticos. \n\n  ### Descrição do site \n\n O site é uma galeria de fotos simples. Aprimorei minhas habilidades em: \n\n - **Entendimento de como organizar pastas e arquivos de seu projeto.** \n\n - **Implementação de componentes da Interface do Usuário.** \n\n - **Saiba como lidar com arquivos estáticos em um projeto React.** \n\n - **Conhecer as vantagens de utilizar o CSS modules e o Sass.** \n\n - **Utilize métodos JavaScript para adicionar funcionalidades a página.** \n\n [Teste o Alura Space aqui!](https://alura-space-black.vercel.app/)  \n\n "
    }
]